if OS.mac?
    # Taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    
    # Applications
    brew "bpytop" # Resource monitor that shows usage and stats for processor, memory, disks, network and processes.
    brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
    brew "fzf" # Fuzzy file searcher, used in scripts and in vim
    brew "trash" # rm, but put in the trash rather than completely delete
    brew "screenresolution" # Get, set, and list display resolution
    
    
    cask "appcleaner" # Application uninstaller
    cask "betterzip" # Utility to create and modify archives
    cask "caffeine" # Utility that prevents the system from going to sleep
    cask "cheatsheet" # Tool to list all active shortcuts of the current application
    cask "chromium" # Free and open-source web browser
    cask "doubletwist" # doubleTwist Sync is a new, lightweight app for your PC to sync your music, videos and pictures over USB or over WiFi.
    cask "imageoptim" # A tool to optimize images
    cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
    cask "qlcolorcode" # QuickLook plug-in that renders source code with syntax highlighting
    cask "qlstephen" # QuickLook plugin that lets you view plain text files without a file extension
    cask "qlmarkdown" # QuickLook generator for Markdown files
    cask "quicklook-json" # QuickLook plugin for JSON files
    cask "qlprettypatch" # QLPrettyPatch is a QuickLook generator for patch files.
    cask "quicklook-csv" # QuickLook plugin for CSV files
    cask "raycast" # Control your tools with a few keystrokes
    cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
    cask "spotify" # Music streaming service
    cask "suspicious-package" # Application for inspecting installer packages
    cask "superduper" # Backup, recovery and cloning software
    cask "temurin" # JDK from the Eclipse Foundation (Adoptium)
    cask "transmission" # Open-source BitTorrent client
    cask "visual-studio-code"
    cask "webpquicklook" # Quick Look Plugin for WebP Files
    
    # Fonts
    cask "font-3270-nerd-font"
    cask "font-cascadia-mono"
    cask "font-dejavu"
    cask "font-fira-code"
    cask "font-hack-nerd-font"
    cask "font-inconsolata"
    cask "font-inconsolata-for-powerline"
    cask "font-jetbrains-mono"
    cask "font-source-code-pro"
elsif OS.linux?
    brew "git-delta" # A better git diff
    brew "xclip" # Access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# Packages
brew "ant" # Java build tool
brew "autoconf" # Automatic configure script builder
brew "asciinema" # Simple terminal recording
brew "bat" # Better cat
brew "bash-completion" # Programmable completion for Bash 3.2
brew "bdw-gc" # Garbage collector for C and C++
brew "berkeley-db" # Oracle's High performance key/value database
brew "broot" # Get an overview of a directory, even a big one
brew "brotli" # Generic-purpose lossless compression algorithm by Google
brew "c-ares" #  C library for asynchronous DNS requests
brew "ca-certificates" # Mozilla CA certificate store
brew "cairo" # Vector graphics library with cross-device output support
brew "cloc" # Lines of code counter
brew "cmatrix" # Escape the matrix
brew "coreutils" # GNU File, Shell, and Text utilities
brew "direnv" # Load/unload environment variables based on $PWD
brew "entr" # File watcher / command runner
brew "exa" # A modern replacement for ls.
brew "fd" # Simple, fast and user-friendly alternative to find
brew "ffmpeg" # A complete, cross-platform solution to record, convert and stream audio and video
brew "figlet" # Banner-like program prints strings as ASCII art
brew "fnm" # Fast Node version manager
brew "fontconfig" # Fontconfig is a library for configuring and customizing font access
brew "freetype" # Software library to render fonts
brew "fribidi" # The Free Implementation of the Unicode Bidirectional Algorithm.
brew "gdbm" # GNU database manager
brew "gdk-pixbuf" # Toolkit for image loading and pixel buffer manipulation
brew "gettext" # GNU internationalization (i18n) and localization (l10n) library
brew "gh" # GitHub CLI
brew "giflib" # Library and utilities for processing GIFs
brew "git" # Git version control (latest version)
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "glib" # Core application library for C
brew "glow" # Render markdown on the CLI
brew "gmp" # GNU multiple precision arithmetic library
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "gnutls" # GNU Transport Layer Security (TLS) Library
brew "gobject-introspection" # GObject introspection is a middleware layer between C libraries
brew "gradle" # Open-source build automation tool based on the Groovy and Kotlin DSL
brew "graphite2" # Smart font renderer for non-Roman scripts
brew "grc" # Colorize logfiles and command output
brew "grep" # Grep (latest)
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "guile" # GNU Ubiquitous Intelligent Language for Extensions
brew "harfbuzz" # OpenType text shaping engine
brew "highlight" # Code syntax highlighting
brew "htop" # A top alternative
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "icu4c" # C/C++ and Java libraries for Unicode and globalization
brew "jpeg" # Image manipulation library
brew "jpeg-turbo" # JPEG image codec that aids compression and decompression
brew "jq" # Work with JSON files in shell scripts
brew "lazygit" # A simple terminal UI for git commands
brew "libassuan" # Assuan IPC Library
brew "libevent" # Asynchronous event library
brew "libffi" # Portable Foreign Function Interface library
brew "libgcrypt" # Cryptographic library based on the code from GnuPG
brew "libgpg-error" # Common error values for all GnuPG components
brew "libidn2" # International domain name library (IDNA2008, Punycode and TR46)
brew "libksba" # X.509 and CMS library
brew "libnghttp2" # HTTP/2 C Library
brew "libpng" # Library for manipulating PNG images
brew "libpthread-stubs" # X.Org: pthread-stubs.pc
brew "librsvg" # Library to render SVG files using Cairo
brew "libtasn1" # ASN.1 structure parser library
brew "libtermkey" # Library for processing keyboard entry from the terminal
brew "libtiff" # TIFF library and utilities
brew "libtool" # Generic library support script
brew "libunistring" # C string library for manipulating Unicode strings
brew "libusb" # Library for USB device access
brew "libuv" # Multi-platform support library with a focus on asynchronous I/O
brew "libx11" # X.Org: Core X11 protocol client library
brew "libxau" # X.Org: A Sample Authorization Protocol for X
brew "libxcb" # X.Org: Interface to the X Window System protocol
brew "libxdmcp" # X.Org: X Display Manager Control Protocol library
brew "libxext" # X.Org: Library for common extensions to the X11 protocol
brew "libxrender" # X.Org: Library for the Render Extension to the X11 protocol
brew "libyaml" # YAML Parser
brew "libnotify" # Library that sends desktop notifications to a notification daemon
brew "lua" # Powerful, lightweight programming language
brew "luajit" # Just-In-Time Compiler (JIT) for the Lua programming language
brew "luv" # Bare libuv bindings for lua
brew "lzo" # Real-time data compression library
brew "m4" # Macro processing language
brew "maven" # Java-based project management
brew "mpdecimal" # Library for decimal floating point arithmetic
brew "msgpack" # Library for a binary-based efficient data interchange format
brew "mysql" # Open source relational database management syste
brew "ncurses" # Text-based UI library
brew "neofetch" # Pretty system info
brew "neovim" # A better vim
brew "nettle" # Low-level cryptographic library
brew "node" # Platform built on V8 to build network applications
brew "noti" # Utility to display notifications from scripts
brew "npth" # New GNU portable threads library
#brew "nvm" # Manage multiple Node.js versions
brew "oniguruma" # Regular expressions library
brew "openjdk" # Development kit for the Java programming language
brew "openssl@1.1" # Cryptography and SSL/TLS Toolkit
brew "p11-kit" # Library to load and enumerate PKCS#11 modules
brew "pango" # Framework for layout and rendering of i18n text
brew "pcre" # Perl compatible regular expressions library
brew "pcre2" # Perl compatible regular expressions library with a new API
brew "perl" # Highly capable, feature-rich programming language
brew "pinentry" # Passphrase entry dialog utilizing the Assuan protocol
brew "pixman" # Low-level library for pixel manipulation
brew "pkg-config" # Manage compile and link flags for libraries
brew "pnpm" # Fast, disk space efficient package manager
brew "postgraphile" # GraphQL schema created by reflection over a PostgreSQL schema
brew "postgresql@14" # Object-relational database system
brew "pyenv" # Python version management
brew "python@3.10" # Interpreted, interactive, object-oriented programming language
brew "python@3.9" # Cairo dependency
brew "readline" # Library for command-line editing
brew "ripgrep" # Very fast file searcher
brew "ruby" # Powerful, clean, object-oriented scripting language
brew "shellcheck" # Diagnostics for shell sripts
brew "spotifyd" # Spotify daemon - Broken with python 3.10 , use <= 3.9
brew "sqlite" # Command-line interface for SQLite
brew "tig" # Git repository browser
brew "tmux" # Terminal multiplexer
brew "tree" # Pretty-print directory contents
brew "tree-sitter" # Parser generator tool and incremental parsing library
brew "unbound" # Validating, recursive, caching DNS resolver
brew "unibilium" # Very basic terminfo library
brew "utf8proc" # Clean C library for processing UTF-8 Unicode data
brew "vim" # Vim (latest)
brew "wdiff" # Display word differences between text files
brew "wget" # Internet file retriever
brew "xorgproto" # X.Org: Protocol Headers
brew "xz" # General-purpose data compression with high compression ratio
brew "z" # Tracks most-used directories to make cd smarter
brew "zsh" # Zsh (latest)


#█▓▒░ Notes
# Not installing nvm - fnm is faster